{
  "backend/main.mo": "Motoko canister managing players and duels with creation, updates, bet validation, and match completion logic.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend React components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light/dark themes and global styling rules.",
  "frontend/index.html": "Base HTML file bootstrapping the React app by loading main.tsx into the root div.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with five routes and wraps them in the AppLayout component.",
  "frontend/src/components/ActiveDuelCard.tsx": "UI card showing details of the active duel, including players, bet visibility logic, and match completion controls.",
  "frontend/src/components/AppLayout.tsx": "App-wide layout providing banner, logo, navigation tabs, and a global error banner wrapper for all routes.",
  "frontend/src/components/DuelForm.tsx": "Form for creating duels, selecting players, validating bets, and triggering random duel generation.",
  "frontend/src/components/GlobalErrorBanner.tsx": "Displays a global error message with a retry button that refreshes the page.",
  "frontend/src/components/MatchCompletionControls.tsx": "UI controls to declare a duel winner with confirmation dialogs and completion mutation.",
  "frontend/src/components/MatchHistoryList.tsx": "Renders a table of completed duels showing players, bets, mode, winner, and hearts transferred.",
  "frontend/src/components/PlayerList.tsx": "Displays a table of players with stats, rank, status, and optional removal actions.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useGlobalInitAndQueryErrors.ts": "Aggregates global initialization and query errors for actor, players, and duels.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating players and duels using an actor, with cache invalidation on updates.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables, themes, and utility classes for styling, including pixel and Minecraft-inspired UI elements.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and mounts it to the DOM.",
  "frontend/src/pages/DashboardPage.tsx": "Displays overall statistics for players and duels using fetched data and computed stats.",
  "frontend/src/pages/DuelPage.tsx": "Shows the most recent pending duel and provides a form to create new duels.",
  "frontend/src/pages/HistoryPage.tsx": "Lists completed duels in reverse chronological order using MatchHistoryList.",
  "frontend/src/pages/LeaderboardPage.tsx": "Renders the player leaderboard sorted by hearts, wins, and name.",
  "frontend/src/pages/PlayersPage.tsx": "Provides UI to add and remove players and displays the full player list.",
  "frontend/src/utils/leaderboard.ts": "Sorts players for leaderboard display using hearts, wins, and name tie-breakers.",
  "frontend/src/utils/stats.ts": "Computes summary statistics from players and duels, including leaders and totals.",
  "frontend/src/vite-env.d.ts": "Includes Vite type definitions for the project.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, custom colors, animations, shadows, and fonts using multiple plugins.",
  "project_state.json": "Project metadata describing the app’s purpose, architecture notes, known issues, and a list of existing frontend feature requirements."
}